[
  {
    "courseId": "apush",
    "courseName": "AP U.S. History",
    "units": [
      {
        "unitId": "unit_1",
        "unitName": "Period 1: 1491-1607 - Native American Societies and European Exploration",
        "topics": [
          {
            "title": "Pre-Columbian Native American Societies",
            "details": [
              "Diverse societies across North America, including nomadic tribes and agricultural communities.",
              "Innovations in agriculture, such as the 'Three Sisters' farming technique (corn, beans, squash).",
              "Complex political and social structures, such as the Iroquois Confederacy.",
              "Trade networks that spanned large distances, connecting different regions."
            ]
          },
          {
            "title": "The Columbian Exchange",
            "details": [
              "Widespread exchange of plants, animals, diseases, and technologies between the Americas, Europe, and Africa.",
              "Introduction of crops like potatoes and maize to Europe, which significantly impacted European diets and populations.",
              "Europeans brought horses, cattle, and diseases such as smallpox to the Americas, which had devastating effects on Native American populations.",
              "The Columbian Exchange also included the transatlantic slave trade, bringing African slaves to the Americas."
            ]
          },
          {
            "title": "Spanish Colonization and the Encomienda System",
            "details": [
              "Spanish exploration led to the conquest of large territories in the Americas, including the Aztec and Inca Empires.",
              "The encomienda system granted Spanish settlers control over indigenous labor in exchange for the promise of protection and Christianization.",
              "Indigenous populations were exploited for labor in mines and plantations, leading to significant social and economic changes."
            ]
          },
          {
            "title": "Impact of European Exploration on Native Americans",
            "details": [
              "European colonization led to widespread displacement and violence against Native American tribes.",
              "The introduction of European diseases decimated indigenous populations, leading to a demographic collapse.",
              "Indigenous communities were forced to adapt to new political, social, and economic realities under European rule."
            ]
          },
          {
            "title": "Debates Over the Treatment of Native Americans",
            "details": [
              "The Valladolid Debate (1550-1551) between Bartolomé de las Casas and Juan Ginés de Sepúlveda focused on the moral and legal justification of Spanish colonization and the treatment of Native Americans.",
              "Las Casas advocated for better treatment of Native Americans, arguing that they were rational beings capable of conversion to Christianity.",
              "Sepúlveda defended the conquest and harsh treatment of Native Americans, claiming they were 'natural slaves' under Aristotelian philosophy."
            ]
          }
        ]
      },
      {
        "unitId": "unit_2",
        "unitName": "Period 2: 1607-1754 - Colonial America",
        "topics": [
          {
            "title": "Settlement of Jamestown and the Chesapeake Colonies",
            "details": [
              "Jamestown, founded in 1607, was the first permanent English settlement in North America.",
              "The colony struggled with disease, famine, and conflict with Native Americans.",
              "Tobacco cultivation became the economic foundation of the Chesapeake colonies (Virginia and Maryland), leading to the expansion of slavery."
            ]
          },
          {
            "title": "Puritan New England: Society, Religion, and Governance",
            "details": [
              "The Puritans settled in New England, seeking religious freedom from persecution in England.",
              "Their society was based on strict religious principles, with governance closely tied to the church.",
              "The Mayflower Compact (1620) established an early form of self-government."
            ]
          },
          {
            "title": "Middle Colonies: Diverse Populations and Economies",
            "details": [
              "The middle colonies (New York, Pennsylvania, New Jersey, Delaware) were known for their diversity in terms of ethnicity and religion.",
              "These colonies had mixed economies, including farming, trade, and manufacturing.",
              "Quakers in Pennsylvania, under the leadership of William Penn, promoted religious tolerance and peaceful relations with Native Americans."
            ]
          },
          {
            "title": "Transatlantic Trade and the Development of the Atlantic World",
            "details": [
              "Colonies participated in a complex system of trade, exchanging raw materials for manufactured goods from Europe.",
              "The triangular trade system included the transatlantic slave trade, which brought African slaves to the Americas.",
              "Mercantilist policies, such as the Navigation Acts, aimed to regulate colonial trade for the benefit of the mother country (England)."
            ]
          },
          {
            "title": "Colonial Resistance to Imperial Control",
            "details": [
              "Tensions between the colonies and England grew due to economic and political restrictions imposed by the Crown.",
              "Colonial assemblies began to assert their autonomy, challenging the authority of royal governors.",
              "The seeds of American revolutionary thought were planted during this period, particularly with events such as Bacon's Rebellion (1676)."
            ]
          }
        ]
      },
      {
        "unitId": "unit_3",
        "unitName": "Period 3: 1754-1800 - American Revolution and Early Republic",
        "topics": [
          {
            "title": "French and Indian War (1754-1763)",
            "details": [
              "The war between Britain and France in North America was part of the larger Seven Years' War.",
              "British victory led to increased territorial claims in North America but also significant debt, prompting new taxes on the colonies.",
              "The war strained British-colonial relations, as colonists felt they had earned greater autonomy after their contributions to the war effort."
            ]
          },
          {
            "title": "Causes of the American Revolution",
            "details": [
              "British policies, including the Stamp Act (1765) and the Townshend Acts (1767), angered colonists, leading to widespread protests.",
              "Enlightenment ideas, such as John Locke's theories of natural rights, inspired colonial leaders to challenge British rule.",
              "Events such as the Boston Massacre (1770) and the Boston Tea Party (1773) fueled revolutionary sentiment."
            ]
          },
          {
            "title": "Key Battles and Figures of the American Revolution",
            "details": [
              "Important battles included the Battle of Lexington and Concord (1775), the Battle of Saratoga (1777), and the Siege of Yorktown (1781).",
              "George Washington, the commander-in-chief of the Continental Army, played a crucial role in the eventual American victory.",
              "Other key figures included Thomas Jefferson, who authored the Declaration of Independence, and Benjamin Franklin, who secured French support for the revolution."
            ]
          },
          {
            "title": "The Articles of Confederation and Constitutional Convention",
            "details": [
              "The Articles of Confederation (1781) established a weak central government with limited powers.",
              "The inability of the government to address economic and political challenges (e.g., Shays' Rebellion) led to calls for a stronger federal system.",
              "The Constitutional Convention (1787) resulted in the drafting of the U.S. Constitution, which created a system of checks and balances and a stronger central government."
            ]
          },
          {
            "title": "The Constitution and the Bill of Rights",
            "details": [
              "The U.S. Constitution was ratified in 1788, creating a federal system with separate executive, legislative, and judicial branches.",
              "The Bill of Rights (1791) guaranteed individual liberties, such as freedom of speech, religion, and the press.",
              "The Federalist Papers, written by Alexander Hamilton, James Madison, and John Jay, argued for the ratification of the Constitution."
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_4",
    "unitName": "Period 4: 1800-1848 - The Growth of Democracy and Market Revolution",
    "topics": [
      {
        "title": "The Jeffersonian Presidency and Expansion of Executive Power",
        "details": [
          "Thomas Jefferson's presidency (1801-1809) marked a shift towards Democratic-Republican ideals of limited government.",
          "The Louisiana Purchase (1803) doubled the size of the United States, expanding westward and increasing executive power.",
          "Jefferson's Embargo Act (1807) aimed to avoid war with Britain and France but had significant economic repercussions on the U.S. economy."
        ]
      },
      {
        "title": "The War of 1812 and American Nationalism",
        "details": [
          "The War of 1812 was fought between the U.S. and Britain due to trade restrictions and impressment of American sailors.",
          "The Treaty of Ghent (1814) ended the war in a stalemate, but the U.S. victory at the Battle of New Orleans (1815) bolstered American nationalism.",
          "The war solidified the U.S. presence in North America and diminished Native American resistance in the Northwest."
        ]
      },
      {
        "title": "The Rise of Political Parties",
        "details": [
          "The early 19th century saw the solidification of political parties: the Federalists and the Democratic-Republicans.",
          "The Federalist Party declined after the War of 1812, leading to the 'Era of Good Feelings' under James Monroe.",
          "Political divisions re-emerged with the rise of Andrew Jackson's Democratic Party, which emphasized populist policies."
        ]
      },
      {
        "title": "Market Revolution: Industrialization and Transportation",
        "details": [
          "The Market Revolution transformed the U.S. economy, with advancements in transportation (e.g., canals, railroads) and communication (telegraphs).",
          "Textile mills and factories in the North contributed to industrialization, while the South remained reliant on cotton and slavery.",
          "The creation of a national market linked regional economies, fostering westward expansion and urbanization."
        ]
      },
      {
        "title": "Jacksonian Democracy and Its Impact",
        "details": [
          "Andrew Jackson's presidency (1829-1837) was marked by the expansion of voting rights for white men and an emphasis on the 'common man.'",
          "The Nullification Crisis and the Indian Removal Act highlighted Jackson's use of federal power to enforce national policies.",
          "Jackson's dismantling of the Second Bank of the United States led to economic instability, culminating in the Panic of 1837."
        ]
      }
    ]
  },
  {
    "unitId": "unit_5",
    "unitName": "Period 5: 1844-1877 - The Civil War and Reconstruction",
    "topics": [
      {
        "title": "Manifest Destiny and Westward Expansion",
        "details": [
          "Manifest Destiny was the belief that the U.S. was destined to expand across the North American continent.",
          "Westward expansion led to conflicts with Native Americans and the Mexican-American War (1846-1848), which resulted in the acquisition of new territories.",
          "The question of whether new territories would permit slavery intensified sectional tensions between the North and the South."
        ]
      },
      {
        "title": "Causes of the Civil War",
        "details": [
          "The Civil War was precipitated by deep-seated divisions over slavery, states' rights, and economic differences between the North and South.",
          "The Compromise of 1850, the Kansas-Nebraska Act, and the Dred Scott decision further polarized the nation.",
          "The election of Abraham Lincoln in 1860, viewed by Southern states as a threat to slavery, led to the secession of Southern states and the formation of the Confederacy."
        ]
      },
      {
        "title": "Key Battles and Strategies of the Civil War",
        "details": [
          "Major battles included Gettysburg, Antietam, and the siege of Vicksburg, which were turning points in the war.",
          "Union strategies, such as the Anaconda Plan and Sherman's March to the Sea, aimed to suffocate the Confederacy's resources.",
          "The Emancipation Proclamation (1863) shifted the focus of the war to ending slavery, bolstering Union support."
        ]
      },
      {
        "title": "Reconstruction: Successes and Failures",
        "details": [
          "Reconstruction (1865-1877) aimed to reintegrate the Southern states into the Union and rebuild the South after the Civil War.",
          "The Radical Republicans in Congress passed the 13th, 14th, and 15th Amendments, which abolished slavery, granted citizenship, and extended voting rights to African Americans.",
          "Reconstruction faced significant resistance from Southern whites, leading to the rise of white supremacist groups like the Ku Klux Klan, and the eventual implementation of Jim Crow laws."
        ]
      }
    ]
  },
  {
    "unitId": "unit_6",
    "unitName": "Period 6: 1865-1898 - Industrialization and the Gilded Age",
    "topics": [
      {
        "title": "The Rise of Big Business and Industrialization",
        "details": [
          "The Gilded Age was characterized by rapid industrial growth, driven by figures like Andrew Carnegie (steel) and John D. Rockefeller (oil).",
          "The development of railroads, steel, and oil industries transformed the American economy and led to the rise of monopolies.",
          "The U.S. shifted from an agrarian society to an industrial powerhouse, though this wealth was concentrated in the hands of a few."
        ]
      },
      {
        "title": "Urbanization and Immigration",
        "details": [
          "The rapid growth of cities, fueled by immigration, created new social and economic challenges, including overcrowding, sanitation issues, and labor conflicts.",
          "Immigrants from Europe and Asia arrived in large numbers, seeking economic opportunities, but often faced discrimination and poor living conditions.",
          "Labor unions, such as the Knights of Labor and the American Federation of Labor, emerged to advocate for workers' rights in response to poor working conditions."
        ]
      },
      {
        "title": "Labor Movements and Workers' Rights",
        "details": [
          "Workers responded to poor conditions with strikes and the formation of labor unions.",
          "Significant labor events included the Haymarket Riot (1886) and the Pullman Strike (1894), which highlighted tensions between labor and industry.",
          "Government responses to labor unrest were often harsh, with the use of federal troops to break strikes, leading to a slow path to labor reform."
        ]
      },
      {
        "title": "Populism and Farmers' Struggles",
        "details": [
          "Farmers in the West and South faced falling crop prices and high railroad rates, leading to widespread discontent.",
          "The Populist Party, formed in the 1890s, called for reforms such as bimetallism, government regulation of railroads, and direct election of senators.",
          "The Populist movement declined after the defeat of William Jennings Bryan in the 1896 presidential election."
        ]
      },
      {
        "title": "Social and Political Reform Movements",
        "details": [
          "The Progressive movement emerged in response to the excesses of the Gilded Age, advocating for social reforms and government regulation of business.",
          "Key reforms included the Sherman Antitrust Act (1890) to combat monopolies and the establishment of settlement houses to aid the urban poor.",
          "Progressive reformers also fought for women's suffrage and temperance, leading to significant changes in American society."
        ]
      }
    ]
  },
  {
    "unitId": "unit_7",
    "unitName": "Period 7: 1890-1945 - The Progressive Era and World Wars",
    "topics": [
      {
        "title": "Progressive Reforms at Local, State, and Federal Levels",
        "details": [
          "The Progressive Era (1890-1920) sought to address the problems caused by industrialization, urbanization, and political corruption.",
          "Key reforms included trust-busting by Theodore Roosevelt, labor laws protecting workers, and the establishment of the Federal Reserve System.",
          "Progressives also pushed for women's suffrage, leading to the 19th Amendment (1920), and prohibition through the 18th Amendment (1919)."
        ]
      },
      {
        "title": "U.S. Imperialism and the Spanish-American War",
        "details": [
          "In the late 19th century, the U.S. pursued an imperialist policy, seeking to expand its influence globally.",
          "The Spanish-American War (1898) resulted in U.S. control over territories like Puerto Rico, Guam, and the Philippines, marking the U.S. as a global power.",
          "Debates over imperialism, including the Anti-Imperialist League's opposition, highlighted tensions about America's role on the world stage."
        ]
      },
      {
        "title": "World War I: Causes and Effects on American Society",
        "details": [
          "The U.S. initially remained neutral in World War I, but entered the conflict in 1917 due to German submarine warfare and the Zimmerman Telegram.",
          "The war effort led to increased government intervention in the economy and propaganda efforts to support the war through the Committee on Public Information.",
          "The Treaty of Versailles and the League of Nations divided public opinion, with the U.S. ultimately rejecting membership in the League."
        ]
      },
      {
        "title": "The Great Depression and the New Deal",
        "details": [
          "The stock market crash of 1929 triggered the Great Depression, leading to widespread unemployment, poverty, and economic instability.",
          "Franklin D. Roosevelt's New Deal (1933-1939) aimed to provide relief, recovery, and reform through programs like Social Security, the Civilian Conservation Corps (CCC), and the Works Progress Administration (WPA).",
          "Critics of the New Deal included conservatives who opposed government intervention and liberals who wanted more aggressive reforms."
        ]
      },
      {
        "title": "World War II and Its Global Impact",
        "details": [
          "The U.S. entered World War II after the Japanese attack on Pearl Harbor in 1941, joining the Allies in the fight against the Axis powers.",
          "World War II transformed the U.S. economy, ending the Great Depression through war production and leading to advancements in technology and industry.",
          "The war's conclusion, with the U.S. dropping atomic bombs on Hiroshima and Nagasaki, marked the beginning of the Cold War and reshaped global politics."
        ]
      }
    ]
  },
  {
    "unitId": "unit_8",
    "unitName": "Period 8: 1945-1980 - The Cold War and Postwar America",
    "topics": [
      {
        "title": "The Origins and Early Years of the Cold War",
        "details": [
          "The Cold War began after World War II as tensions rose between the U.S. and the Soviet Union over ideological and geopolitical differences.",
          "Key events include the Marshall Plan (1948) to rebuild Europe, the Berlin Airlift (1948-1949), and the formation of NATO (1949).",
          "The U.S. adopted a policy of containment to prevent the spread of communism, leading to involvement in conflicts like the Korean War (1950-1953)."
        ]
      },
      {
        "title": "The Red Scare and McCarthyism",
        "details": [
          "The early Cold War years were marked by fears of communist infiltration in the U.S., leading to the Red Scare.",
          "Senator Joseph McCarthy became the face of anti-communism, accusing government officials and others of being communists in a campaign of fear and accusation known as McCarthyism.",
          "McCarthyism led to widespread paranoia, blacklisting in Hollywood, and ruined careers before McCarthy's fall from grace in 1954."
        ]
      },
      {
        "title": "The Civil Rights Movement",
        "details": [
          "The postwar period saw the rise of the Civil Rights Movement, as African Americans and their allies fought to end segregation and racial injustice.",
          "Key events included the Brown v. Board of Education decision (1954), which declared segregation in public schools unconstitutional, and the Montgomery Bus Boycott (1955-1956), led by Martin Luther King Jr.",
          "The Civil Rights Act of 1964 and the Voting Rights Act of 1965 marked significant legislative victories, but the movement continued to face challenges from white supremacist groups and institutional racism."
        ]
      },
      {
        "title": "The Vietnam War and Its Impact on American Society",
        "details": [
          "The U.S. escalated its involvement in Vietnam in the 1960s to prevent the spread of communism, leading to widespread protests and opposition at home.",
          "The Tet Offensive (1968) shocked the American public and contributed to growing disillusionment with the war effort.",
          "The war deeply divided American society and led to questions about U.S. foreign policy, ultimately ending in 1975 with the fall of Saigon and the unification of Vietnam under communist control."
        ]
      },
      {
        "title": "Social and Cultural Changes of the 1960s and 1970s",
        "details": [
          "The 1960s and 1970s saw a wave of social and cultural change, including the rise of the counterculture movement, second-wave feminism, and environmentalism.",
          "The women's rights movement achieved significant gains with the passage of Title IX (1972) and the legalization of abortion through Roe v. Wade (1973).",
          "The environmental movement led to the establishment of Earth Day (1970) and the passage of key legislation, including the Clean Air Act (1970) and the Endangered Species Act (1973)."
        ]
      }
    ]
  },
  {
    "unitId": "unit_9",
    "unitName": "Period 9: 1980-Present - Contemporary America",
    "topics": [
      {
        "title": "The Reagan Presidency and the Rise of Conservatism",
        "details": [
          "Ronald Reagan's presidency (1981-1989) marked a resurgence of conservative values, focusing on reducing the size of government and cutting taxes.",
          "Reagan's economic policies, known as 'Reaganomics,' emphasized supply-side economics, which aimed to stimulate growth by cutting taxes and reducing regulation.",
          "The Reagan administration also increased defense spending, contributing to the end of the Cold War, and took a tough stance on the Soviet Union, famously calling it the 'evil empire.'"
        ]
      },
      {
        "title": "The End of the Cold War and the Collapse of the Soviet Union",
        "details": [
          "The Cold War ended in 1991 with the collapse of the Soviet Union, following reforms by Soviet leader Mikhail Gorbachev (glasnost and perestroika).",
          "Key events included the fall of the Berlin Wall (1989), the reunification of Germany, and the dissolution of the Warsaw Pact.",
          "The U.S. emerged as the world's sole superpower, but the post-Cold War world saw new challenges, including ethnic conflicts and the rise of new geopolitical tensions."
        ]
      },
      {
        "title": "The War on Terror and U.S. Foreign Policy",
        "details": [
          "The September 11, 2001, terrorist attacks led to the U.S. launching the War on Terror, with invasions of Afghanistan (2001) and Iraq (2003).",
          "The Iraq War, justified by claims of weapons of mass destruction (WMDs), became highly controversial due to the absence of such weapons and the prolonged conflict that followed.",
          "The War on Terror reshaped U.S. foreign policy, with a focus on counterterrorism and efforts to promote democracy in the Middle East."
        ]
      },
      {
        "title": "Economic and Social Changes in the Late 20th and Early 21st Centuries",
        "details": [
          "The U.S. economy shifted from manufacturing to services and technology, leading to the rise of the information age and globalization.",
          "Economic inequality grew, with debates over the role of government in addressing issues like healthcare, education, and income disparity.",
          "Social changes included the legalization of same-sex marriage (2015) and ongoing debates over immigration, race relations, and environmental policy."
        ]
      },
      {
        "title": "Environmental Issues and Climate Change",
        "details": [
          "In the 21st century, climate change became a central issue, with debates over the role of fossil fuels, renewable energy, and international agreements like the Paris Agreement (2015).",
          "Environmental movements called for stronger regulations to combat global warming and protect natural resources.",
          "The U.S. government and private sector have faced pressure to address climate change while balancing economic growth and energy needs."
        ]
      }
    ]
  },
  {
    "courseId": "apcalc",
    "courseName": "AP Calculus BC",
    "units": [
      {
        "unitId": "unit_1",
        "unitName": "Unit 1: Limits and Continuity",
        "topics": [
          {
            "topicName": "Understanding Limits",
            "details": [
              "Limits describe the value that a function approaches as the input approaches a specific point.",
              "Limits are essential for defining derivatives and integrals.",
              "They can be evaluated graphically (by looking at a graph), numerically (by plugging in values), and algebraically (by using limit laws and algebra)."
            ]
          },
          {
            "topicName": "Properties of Limits",
            "details": [
              "Limit properties include sum, difference, product, and quotient rules, which make calculating limits easier.",
              "If limits approach indeterminate forms, special techniques like factoring, conjugates, or L'Hopital’s Rule may be applied."
            ]
          },
          {
            "topicName": "Continuity",
            "details": [
              "A function is continuous if there are no breaks, jumps, or holes in the graph, and the limit at each point equals the function value.",
              "Discontinuities can be removable (holes) or non-removable (jumps, asymptotes).",
              "Continuity is vital for the applicability of many calculus concepts, including the Intermediate Value Theorem."
            ]
          }
        ]
      },
      {
        "unitId": "unit_2",
        "unitName": "Unit 2: Differentiation - Definition and Basic Derivative Rules",
        "topics": [
          {
            "topicName": "Definition of the Derivative",
            "details": [
              "The derivative represents the rate of change of a function with respect to a variable.",
              "It is defined as the limit of the average rate of change as the interval approaches zero.",
              "Geometrically, the derivative is the slope of the tangent line to the function at a given point."
            ]
          },
          {
            "topicName": "Basic Derivative Rules",
            "details": [
              "The power rule, product rule, quotient rule, and chain rule are foundational techniques for finding derivatives.",
              "These rules simplify complex derivative calculations by breaking them into manageable steps."
            ]
          },
          {
            "topicName": "Higher-Order Derivatives",
            "details": [
              "Higher-order derivatives are derivatives of derivatives, and they describe the rate of change of a rate of change.",
              "For example, the second derivative provides information on the concavity of a function or its acceleration."
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_3",
    "unitName": "Unit 3: Differentiation - Composite, Implicit, and Inverse Functions",
    "topics": [
      {
        "topicName": "The Chain Rule",
        "details": [
          "The chain rule is used to differentiate composite functions, where one function is nested inside another.",
          "It states that the derivative of a composite function is the derivative of the outer function times the derivative of the inner function.",
          "This rule is essential for complex functions such as trigonometric, exponential, or logarithmic compositions."
        ]
      },
      {
        "topicName": "Implicit Differentiation",
        "details": [
          "Implicit differentiation is used when functions are not given explicitly as y = f(x) but instead are presented in a form where both variables x and y are mixed.",
          "It involves differentiating both sides of the equation with respect to x while treating y as an implicit function of x.",
          "This technique is often used for finding the slope of tangents to curves defined by equations that cannot easily be solved for y."
        ]
      },
      {
        "topicName": "Derivatives of Inverse Functions",
        "details": [
          "To find the derivative of an inverse function, you use the rule: if f and g are inverse functions, then g'(x) = 1 / f'(g(x)).",
          "This is applied to inverse trigonometric functions such as arcsin, arccos, and arctan, and inverse exponential and logarithmic functions."
        ]
      }
    ]
  },
  {
    "unitId": "unit_4",
    "unitName": "Unit 4: Contextual Applications of Differentiation",
    "topics": [
      {
        "topicName": "Analyzing Functions Using Derivatives",
        "details": [
          "Derivatives are used to find critical points, which help identify where functions increase, decrease, or have relative maxima and minima.",
          "First and second derivative tests provide methods for determining the behavior of a function and its concavity.",
          "This analysis is useful for graphing functions and understanding their behavior at different intervals."
        ]
      },
      {
        "topicName": "Optimization Problems",
        "details": [
          "Optimization involves finding the maximum or minimum values of a function, often subject to constraints.",
          "These problems arise in real-world situations like minimizing cost or maximizing efficiency.",
          "The process involves taking the derivative to find critical points and then using second derivative tests to confirm maxima or minima."
        ]
      },
      {
        "topicName": "Related Rates",
        "details": [
          "Related rates problems involve finding how different quantities change with respect to time when they are related by some equation.",
          "To solve these problems, implicit differentiation is often used to relate the rates of change of the different variables.",
          "A diagram and careful organization of known rates can help in solving these often complex problems."
        ]
      }
    ]
  },
  {
    "unitId": "unit_5",
    "unitName": "Unit 5: Analytical Applications of Differentiation",
    "topics": [
      {
        "topicName": "The Mean Value Theorem",
        "details": [
          "The Mean Value Theorem (MVT) states that for a continuous and differentiable function, there is at least one point on the curve where the tangent is parallel to the secant line connecting two points.",
          "This theorem helps in analyzing the behavior of functions and provides information about their increasing or decreasing behavior.",
          "In applied contexts, MVT can help understand changes in velocity, population growth, or other time-related quantities."
        ]
      },
      {
        "topicName": "First and Second Derivative Tests",
        "details": [
          "The first derivative test helps determine where a function is increasing or decreasing and the location of relative maxima and minima.",
          "The second derivative test determines concavity and points of inflection, providing more detailed information about the shape of the graph.",
          "Both tests are essential for thoroughly analyzing and sketching the graph of a function."
        ]
      },
      {
        "topicName": "Motion and Particle Movement",
        "details": [
          "Derivatives are used to describe the motion of particles in terms of position, velocity, and acceleration.",
          "Velocity is the derivative of position, and acceleration is the derivative of velocity.",
          "These applications are used in physics and other sciences to model real-world phenomena such as falling objects or projectiles."
        ]
      }
    ]
  },
  {
    "unitId": "unit_6",
    "unitName": "Unit 6: Integration and Accumulation of Change",
    "topics": [
      {
        "topicName": "The Definite Integral",
        "details": [
          "The definite integral represents the accumulation of quantities, such as area under a curve or total distance traveled.",
          "It is evaluated using the Fundamental Theorem of Calculus, which connects differentiation and integration.",
          "This concept is essential for solving problems involving accumulated change over intervals, such as calculating displacement or net change."
        ]
      },
      {
        "topicName": "Riemann Sums and Trapezoidal Rule",
        "details": [
          "Riemann sums are used to approximate the value of a definite integral by dividing the area under a curve into small rectangles.",
          "The trapezoidal rule improves this approximation by using trapezoids instead of rectangles to estimate areas more accurately.",
          "Both methods are useful for understanding how integration works and for approximating integrals when an exact answer is difficult to find."
        ]
      },
      {
        "topicName": "Fundamental Theorem of Calculus",
        "details": [
          "The Fundamental Theorem of Calculus (FTC) links the concept of a derivative with that of an integral.",
          "Part 1 of the FTC states that the definite integral of a function can be found using its antiderivative.",
          "Part 2 explains that the derivative of an integral function is the original function itself.",
          "The FTC provides the foundation for many calculus applications in physics, engineering, and other fields."
        ]
      }
    ]
  },
  {
    "unitId": "unit_7",
    "unitName": "Unit 7: Differential Equations",
    "topics": [
      {
        "topicName": "Slope Fields",
        "details": [
          "Slope fields provide a graphical representation of differential equations, showing the slopes of solutions at various points.",
          "By sketching slope fields, students can visualize solutions to differential equations without actually solving them.",
          "Slope fields are especially useful for understanding the behavior of solutions over different intervals."
        ]
      },
      {
        "topicName": "Separable Differential Equations",
        "details": [
          "Separable differential equations can be solved by separating variables and integrating both sides.",
          "These types of equations often appear in modeling real-world situations, such as population growth or cooling processes.",
          "Once variables are separated, integration allows us to find general or particular solutions to the differential equation."
        ]
      },
      {
        "topicName": "Exponential Growth and Decay",
        "details": [
          "Exponential growth and decay models describe situations where the rate of change of a quantity is proportional to the quantity itself.",
          "This concept is used to model population growth, radioactive decay, and other processes where change happens continuously over time.",
          "These differential equations typically result in exponential functions as solutions."
        ]
      }
    ]
  },
  {
    "unitId": "unit_8",
    "unitName": "Applications of Integration",
    "topics": [
      {
        "topicName": "Area Between Curves",
        "details": [
          "The area between two curves can be found by integrating the difference between the top and bottom functions.",
          "This technique is useful for finding the exact area of regions bounded by curves, especially in applied problems like economics or physics.",
          "Understanding how to set up and evaluate these integrals is essential for solving real-world area problems."
        ]
      },
      {
        "topicName": "Volumes of Solids of Revolution",
        "details": [
          "Volumes of solids of revolution are calculated using the disk and washer methods.",
          "The disk method is used when revolving a region around an axis, while the washer method is used when the region has a hole in it.",
          "These techniques are applied in various fields, including engineering and design, to calculate the volumes of 3D objects."
        ]
      },
      {
        "topicName": "Arc Length",
        "details": [
          "Arc length is the distance along a curve, found by integrating the square root of 1 plus the derivative squared.",
          "This concept is used to calculate the length of paths, curves, or trajectories in real-world applications.",
          "Finding arc length involves setting up and solving a specific integral that depends on the derivative of the function."
        ]
      }
    ]
  },
  {
    "unitId": "unit_9",
    "unitName": "Unit 9: Parametric Equations, Polar Coordinates, and Vector-Valued Functions",
    "topics": [
      {
        "topicName": "Derivatives of Parametric Functions",
        "details": [
          "Parametric equations express the coordinates of points on a curve as functions of a parameter, often time.",
          "The derivative of a parametric function involves taking the derivative of both the x and y components with respect to the parameter.",
          "Applications include calculating the rate of change and velocity in systems described by parametric functions."
        ]
      },
      {
        "topicName": "Calculus with Polar Coordinates",
        "details": [
          "In polar coordinates, points are defined by a distance from the origin and an angle from the positive x-axis.",
          "Calculus in polar form involves finding areas and lengths of curves using polar integrals.",
          "Converting between Cartesian and polar coordinates is a crucial skill for solving problems."
        ]
      },
      {
        "topicName": "Vector-Valued Functions",
        "details": [
          "Vector-valued functions describe motion in two or three dimensions by providing a function for each spatial component (x, y, z).",
          "Derivatives of vector-valued functions give velocity, and second derivatives give acceleration.",
          "Applications include physics problems involving projectile motion and forces."
        ]
      }
    ]
  },
  {
    "unitId": "unit_10",
    "unitName": "Unit 10: Infinite Sequences and Series",
    "topics": [
      {
        "topicName": "Convergence and Divergence of Sequences",
        "details": [
          "A sequence converges if it approaches a specific value as the index increases, and diverges if it does not.",
          "Tests for convergence include the limit test and the comparison test, among others.",
          "Understanding convergence is critical for determining whether infinite series will sum to a finite value."
        ]
      },
      {
        "topicName": "Convergence Tests for Series",
        "details": [
          "Series are sums of terms from sequences, and determining whether a series converges or diverges requires various tests.",
          "Common convergence tests include the ratio test, root test, and integral test.",
          "These tests help determine the behavior of infinite series, crucial in advanced mathematical analysis."
        ]
      },
      {
        "topicName": "Power Series and Taylor Series",
        "details": [
          "Power series represent functions as infinite sums of terms involving powers of a variable.",
          "Taylor series are specific types of power series centered around a particular point, used to approximate functions.",
          "Understanding the interval of convergence for a power series is important for determining where the approximation is valid."
        ]
      }
    ]
  },
  {
    "courseId": "apphysicsc_mechanics",
    "courseName": "AP Physics C: Mechanics",
    "units": [
      {
        "unitId": "unit_1",
        "unitName": "Unit 1: Kinematics",
        "sections": [
          {
            "sectionName": "Motion in One Dimension",
            "topics": [
              {
                "topicName": "Position, Velocity, and Acceleration",
                "details": [
                  "Position: A vector quantity that describes the location of an object at a particular point in time.",
                  "Velocity: The rate of change of position with respect to time, a vector quantity.",
                  "Acceleration: The rate of change of velocity over time."
                ]
              },
              {
                "topicName": "Kinematic Equations",
                "details": [
                  "Equations that describe uniformly accelerated motion, including:",
                  "v = u + at (final velocity in terms of initial velocity, acceleration, and time).",
                  "s = ut + ½at² (displacement in terms of initial velocity, time, and acceleration).",
                  "v² = u² + 2as (final velocity squared in terms of initial velocity, acceleration, and displacement)."
                ]
              },
              {
                "topicName": "Free Fall and Gravity",
                "details": [
                  "Understanding free fall motion as a special case of uniform acceleration under gravity.",
                  "Gravitational acceleration (g) is approximately 9.8 m/s² on Earth, and is considered constant near Earth's surface.",
                  "Analyzing problems involving objects in free fall, taking downward as the positive direction or applying a negative acceleration for gravity."
                ]
              }
            ]
          },
          {
            "sectionName": "Motion in Two Dimensions",
            "topics": [
              {
                "topicName": "Projectile Motion",
                "details": [
                  "Understanding that projectile motion consists of two independent components of motion: horizontal and vertical.",
                  "Horizontal motion has constant velocity (ignoring air resistance), and vertical motion has constant acceleration due to gravity.",
                  "Equations of motion can be applied independently to both components to analyze projectiles."
                ]
              },
              {
                "topicName": "Relative Velocity",
                "details": [
                  "Understanding relative velocity as the velocity of one object as observed from another moving object.",
                  "Application of vector addition and subtraction to find the relative velocity between two objects."
                ]
              }
            ]
          }
        ]
      },
      {
        "unitId": "unit_2",
        "unitName": "Unit 2: Newton’s Laws of Motion",
        "sections": [
          {
            "sectionName": "Forces and Newton's Laws",
            "topics": [
              {
                "topicName": "Newton's First Law (Law of Inertia)",
                "details": [
                  "An object at rest stays at rest, and an object in motion continues in motion with the same speed and in the same direction unless acted upon by a net external force.",
                  "Inertia: The resistance of any physical object to any change in its state of motion."
                ]
              },
              {
                "topicName": "Newton's Second Law",
                "details": [
                  "The net force acting on an object is equal to the product of its mass and its acceleration (F = ma).",
                  "Applications include understanding how forces cause changes in motion and acceleration."
                ]
              },
              {
                "topicName": "Newton's Third Law",
                "details": [
                  "For every action, there is an equal and opposite reaction.",
                  "The force exerted by object A on object B is equal in magnitude but opposite in direction to the force exerted by object B on object A."
                ]
              }
            ]
          },
          {
            "sectionName": "Applications of Newton’s Laws",
            "topics": [
              {
                "topicName": "Free-Body Diagrams",
                "details": [
                  "Free-body diagrams are used to represent the forces acting on an object.",
                  "They help in solving problems involving Newton's Laws by visualizing all forces (gravity, normal force, tension, friction, etc.)."
                ]
              },
              {
                "topicName": "Friction, Tension, and Normal Force",
                "details": [
                  "Friction: A force that opposes the relative motion or tendency of such motion of two surfaces in contact.",
                  "Tension: The pulling force exerted by a string, rope, or cable.",
                  "Normal Force: The perpendicular contact force exerted by a surface on another object."
                ]
              },
              {
                "topicName": "Circular Motion and Centripetal Force",
                "details": [
                  "In uniform circular motion, the direction of the velocity changes constantly, which results in an acceleration towards the center of the circle (centripetal acceleration).",
                  "Centripetal force is the net force that causes centripetal acceleration, directed toward the center of the circular path."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_3",
    "unitName": "Unit 3: Work, Energy, and Power",
    "sections": [
      {
        "sectionName": "Work and Energy",
        "topics": [
          {
            "topicName": "Work-Energy Theorem",
            "details": [
              "The Work-Energy Theorem states that the net work done by the forces on an object is equal to the change in its kinetic energy.",
              "Work (W) is defined as the product of the force and the displacement in the direction of the force: W = Fd cos(θ).",
              "Kinetic energy (KE) is the energy an object possesses due to its motion, KE = ½mv²."
            ]
          },
          {
            "topicName": "Conservation of Mechanical Energy",
            "details": [
              "Mechanical energy is the sum of kinetic and potential energy in a system. It is conserved when only conservative forces (like gravity) act on the system.",
              "Conservative forces: Forces that store energy in a way that it can be fully recovered (e.g., gravitational force, spring force).",
              "Non-conservative forces, such as friction, cause energy loss (e.g., heat, sound)."
            ]
          },
          {
            "topicName": "Power and Efficiency",
            "details": [
              "Power is the rate at which work is done or energy is transferred: P = W/t.",
              "Power can also be expressed as P = Fv, where F is force and v is velocity.",
              "Efficiency is the ratio of the useful energy output to the total energy input, often expressed as a percentage: Efficiency = (useful energy / total energy) × 100%."
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_4",
    "unitName": "Unit 4: Momentum",
    "sections": [
      {
        "sectionName": "Linear Momentum",
        "topics": [
          {
            "topicName": "Impulse and Momentum",
            "details": [
              "Momentum (p) is the product of an object's mass and its velocity: p = mv.",
              "Impulse (J) is the change in momentum, and it is the product of force and time: J = Ft.",
              "The Impulse-Momentum Theorem states that the impulse on an object is equal to its change in momentum."
            ]
          },
          {
            "topicName": "Conservation of Linear Momentum",
            "details": [
              "The total momentum of an isolated system remains constant if no external forces act on it (Law of Conservation of Momentum).",
              "This principle is applied in collision problems, where the total momentum before the collision equals the total momentum after the collision."
            ]
          },
          {
            "topicName": "Elastic and Inelastic Collisions",
            "details": [
              "In an elastic collision, both kinetic energy and momentum are conserved.",
              "In an inelastic collision, momentum is conserved but kinetic energy is not; the objects may stick together after colliding."
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_5",
    "unitName": "Unit 5: Rotation",
    "sections": [
      {
        "sectionName": "Rotational Motion",
        "topics": [
          {
            "topicName": "Angular Kinematics and Angular Velocity",
            "details": [
              "Angular kinematics describes rotational motion in a manner similar to linear kinematics, using quantities like angular displacement (θ), angular velocity (ω), and angular acceleration (α).",
              "Equations for rotational motion parallel linear motion equations, e.g., ω = ω₀ + αt and θ = ω₀t + ½αt².",
              "Angular velocity (ω) is the rate of change of angular displacement, typically measured in radians per second."
            ]
          },
          {
            "topicName": "Torque and Rotational Inertia",
            "details": [
              "Torque (τ) is the rotational equivalent of force, given by τ = rFsin(θ), where r is the distance from the axis of rotation.",
              "Rotational inertia (moment of inertia, I) depends on the mass distribution relative to the axis of rotation: I = Σmr².",
              "Newton's Second Law for rotation is τ = Iα, where α is the angular acceleration."
            ]
          },
          {
            "topicName": "Conservation of Angular Momentum",
            "details": [
              "Angular momentum (L) is given by L = Iω, where I is the moment of inertia and ω is the angular velocity.",
              "In an isolated system (no external torques), angular momentum is conserved: L₁ = L₂.",
              "This principle explains phenomena such as a figure skater speeding up when pulling their arms inward."
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_6",
    "unitName": "Unit 6: Gravitation",
    "sections": [
      {
        "sectionName": "Gravitational Physics",
        "topics": [
          {
            "topicName": "Newton’s Law of Universal Gravitation",
            "details": [
              "Newton's Law of Universal Gravitation states that the gravitational force (F) between two masses (m₁ and m₂) is proportional to the product of the masses and inversely proportional to the square of the distance between them: F = G(m₁m₂)/r².",
              "The gravitational constant (G) is 6.674×10⁻¹¹ N(m²/kg²).",
              "This law applies universally, from objects on Earth to planets in space."
            ]
          },
          {
            "topicName": "Gravitational Potential Energy",
            "details": [
              "Gravitational potential energy (U) is the energy an object possesses due to its position in a gravitational field: U = -G(m₁m₂)/r.",
              "This formula applies to objects at significant distances (astronomical scales), while near Earth's surface, U = mgh is commonly used."
            ]
          },
          {
            "topicName": "Orbits and Kepler’s Laws",
            "details": [
              "Kepler's First Law: Planets move in elliptical orbits with the Sun at one focus.",
              "Kepler's Second Law: A line drawn from the planet to the Sun sweeps out equal areas in equal time intervals.",
              "Kepler's Third Law: The square of a planet's orbital period (T) is proportional to the cube of the semi-major axis (a) of its orbit: T² ∝ a³."
            ]
          }
        ]
      }
    ]
  },
  {
    "unitId": "unit_7",
    "unitName": "Unit 7: Oscillations and Simple Harmonic Motion",
    "sections": [
      {
        "sectionName": "Simple Harmonic Motion (SHM)",
        "topics": [
          {
            "topicName": "Definition and Characteristics of SHM",
            "details": [
              "Simple Harmonic Motion is a type of oscillatory motion where the restoring force is proportional to the displacement from equilibrium: F = -kx.",
              "Examples include masses on springs and pendulums, provided the motion is small and follows Hooke’s law.",
              "Key quantities include amplitude (A), angular frequency (ω), and period (T)."
            ]
          },
          {
            "topicName": "Energy in Simple Harmonic Motion",
            "details": [
              "In SHM, energy oscillates between kinetic energy (KE = ½mv²) and potential energy (PE = ½kx²) as the object moves through equilibrium and maximum displacement.",
              "The total mechanical energy in SHM is conserved and is equal to the sum of KE and PE at any point in the motion."
            ]
          },
          {
            "topicName": "Damped Harmonic Motion",
            "details": [
              "Damping occurs when a resistive force (like friction or air resistance) reduces the amplitude of oscillations over time.",
              "In underdamped motion, oscillations continue with decreasing amplitude, while critically damped and overdamped systems return to equilibrium without oscillating."
            ]
          }
        ]
      }
    ]
  },
  {
    "courseId": "apphysicsc_electricity",
    "courseName": "AP Physics C: Electricity and Magnetism",
    "units": [
      {
        "unitId": "unit_1",
        "unitName": "Unit 1: Electrostatics",
        "sections": [
          {
            "sectionName": "Electric Charge and Coulomb’s Law",
            "topics": [
              {
                "topicName": "Electric Charge",
                "details": [
                  "Electric charge is a fundamental property of matter that causes it to experience a force in an electric field.",
                  "There are two types of charge: positive and negative. Like charges repel, and opposite charges attract.",
                  "Charge is conserved in a closed system, meaning the total charge remains constant.",
                  "The unit of charge is the coulomb (C), and the elementary charge is approximately 1.6 x 10⁻¹⁹ C."
                ]
              },
              {
                "topicName": "Coulomb’s Law",
                "details": [
                  "Coulomb’s Law describes the force between two point charges.",
                  "The force is directly proportional to the product of the magnitudes of the charges and inversely proportional to the square of the distance between them.",
                  "The formula is F = k * |q₁q₂| / r², where k is Coulomb’s constant (8.99 x 10⁹ N m²/C²).",
                  "The force is attractive if the charges are of opposite sign and repulsive if they are the same."
                ]
              }
            ]
          },
          {
            "sectionName": "Electric Fields",
            "topics": [
              {
                "topicName": "Electric Field Definition",
                "details": [
                  "An electric field is a region around a charged particle where other charges experience a force.",
                  "The strength of the electric field (E) is defined as the force per unit charge: E = F/q.",
                  "Electric field lines point away from positive charges and toward negative charges.",
                  "The SI unit of the electric field is newtons per coulomb (N/C) or volts per meter (V/m)."
                ]
              },
              {
                "topicName": "Electric Field of a Point Charge",
                "details": [
                  "The electric field due to a point charge is given by E = k * |q| / r², where q is the charge and r is the distance from the charge.",
                  "The field decreases with the square of the distance from the charge.",
                  "Field lines radiate outward for positive charges and inward for negative charges."
                ]
              }
            ]
          }
        ]
      },
      {
        "unitId": "unit_2",
        "unitName": "Unit 2: Capacitors and Dielectrics",
        "sections": [
          {
            "sectionName": "Capacitance",
            "topics": [
              {
                "topicName": "Definition of Capacitance",
                "details": [
                  "Capacitance is the ability of a system to store electric charge.",
                  "It is defined as the ratio of the charge (Q) on each conductor to the potential difference (V) between them: C = Q/V.",
                  "The unit of capacitance is the farad (F), where 1 F = 1 coulomb per volt (C/V)."
                ]
              },
              {
                "topicName": "Parallel Plate Capacitor",
                "details": [
                  "A parallel plate capacitor consists of two conducting plates separated by a distance, with an insulating material (dielectric) in between.",
                  "The capacitance is given by C = ε₀ * A / d, where A is the area of the plates, d is the separation, and ε₀ is the permittivity of free space.",
                  "Adding a dielectric increases the capacitance because the dielectric reduces the electric field, allowing more charge to be stored for the same potential difference."
                ]
              }
            ]
          },
          {
            "sectionName": "Dielectrics",
            "topics": [
              {
                "topicName": "Role of Dielectrics in Capacitors",
                "details": [
                  "Dielectrics are insulating materials placed between the plates of a capacitor to increase its capacitance.",
                  "They polarize in the presence of an electric field, reducing the effective field inside the capacitor.",
                  "The capacitance with a dielectric is given by C = κ * C₀, where κ is the dielectric constant and C₀ is the capacitance without the dielectric."
                ]
              },
              {
                "topicName": "Dielectric Breakdown",
                "details": [
                  "When the electric field inside a dielectric becomes too strong, the material can undergo dielectric breakdown, where it becomes conductive.",
                  "This can lead to the failure of the capacitor.",
                  "The breakdown strength of a dielectric is the maximum electric field it can withstand without breaking down."
                ]
              }
            ]
          }
        ]
      },
      {
        "unitId": "unit_3",
        "unitName": "Unit 3: Electric Circuits",
        "sections": [
          {
            "sectionName": "Ohm's Law and Resistance",
            "topics": [
              {
                "topicName": "Ohm's Law",
                "details": [
                  "Ohm's Law defines the relationship between voltage (V), current (I), and resistance (R) in a circuit: V = IR.",
                  "This law is fundamental in understanding how electric circuits operate, as it explains how current flows through a conductor.",
                  "The resistance in a conductor determines how easily current can pass through the material."
                ]
              },
              {
                "topicName": "Resistors in Series and Parallel",
                "details": [
                  "In a series circuit, resistors are connected end-to-end, and the total resistance is the sum of the individual resistances: R_total = R₁ + R₂ + ... + Rn.",
                  "In a parallel circuit, resistors are connected across the same two points, and the total resistance is given by: 1/R_total = 1/R₁ + 1/R₂ + ... + 1/Rn.",
                  "Series circuits have the same current passing through all components, while parallel circuits have the same voltage across each component."
                ]
              }
            ]
          },
          {
            "sectionName": "Kirchhoff's Laws",
            "topics": [
              {
                "topicName": "Kirchhoff's Current Law (KCL)",
                "details": [
                  "KCL states that the total current entering a junction is equal to the total current leaving the junction.",
                  "This law is based on the principle of conservation of charge.",
                  "It is used to analyze complex circuits with multiple branches."
                ]
              },
              {
                "topicName": "Kirchhoff's Voltage Law (KVL)",
                "details": [
                  "KVL states that the sum of the electromotive forces (emf) and the potential differences in any closed loop of a circuit is equal to zero.",
                  "This law is based on the conservation of energy and is used to calculate unknown voltages in a circuit."
                ]
              }
            ]
          },
          {
            "sectionName": "RC Circuits (Charging and Discharging)",
            "topics": [
              {
                "topicName": "Charging a Capacitor",
                "details": [
                  "In an RC circuit, a capacitor charges over time when connected to a voltage source.",
                  "The voltage across the capacitor increases exponentially as it approaches the source voltage, following the equation V(t) = V₀(1 - e^(-t/RC)).",
                  "The time constant, τ = RC, determines how quickly the capacitor charges."
                ]
              },
              {
                "topicName": "Discharging a Capacitor",
                "details": [
                  "When the voltage source is removed, the capacitor discharges, and the voltage across it decreases exponentially: V(t) = V₀e^(-t/RC).",
                  "The same time constant (τ = RC) governs the rate at which the capacitor discharges.",
                  "These equations are essential for understanding how energy is stored and released in capacitive circuits."
                ]
              }
            ]
          }
        ]
      },
      {
        "unitId": "unit_4",
        "unitName": "Unit 4: Magnetic Fields",
        "sections": [
          {
            "sectionName": "Magnetic Forces",
            "topics": [
              {
                "topicName": "Magnetic Force on Moving Charges",
                "details": [
                  "When a charged particle moves through a magnetic field, it experiences a force perpendicular to both its velocity and the magnetic field direction, as described by the equation: F = qvBsin(θ), where F is the force, q is the charge, v is the velocity, and B is the magnetic field strength.",
                  "The direction of the force is given by the right-hand rule, which helps determine how charged particles, such as electrons, move in a magnetic field.",
                  "This force is responsible for the circular or spiral motion of charged particles in magnetic fields."
                ]
              },
              {
                "topicName": "Magnetic Force on Current-Carrying Wires",
                "details": [
                  "A current-carrying wire in a magnetic field also experiences a force, following the equation: F = ILBsin(θ), where I is the current, L is the length of the wire, and B is the magnetic field strength.",
                  "The direction of the force is determined by the right-hand rule, with the thumb pointing along the current and the fingers pointing in the direction of the magnetic field.",
                  "This principle is used in devices such as electric motors, where magnetic forces cause rotational motion."
                ]
              }
            ]
          },
          {
            "sectionName": "Magnetic Fields Due to Currents",
            "topics": [
              {
                "topicName": "Biot-Savart Law",
                "details": [
                  "The Biot-Savart Law describes the magnetic field produced by a small segment of current-carrying wire. It states that the magnetic field dB at a point is directly proportional to the current element IdL and inversely proportional to the square of the distance from the current element.",
                  "The direction of the magnetic field follows the right-hand rule, circling around the current-carrying wire.",
                  "This law is essential for calculating the magnetic fields in more complex configurations such as loops and solenoids."
                ]
              },
              {
                "topicName": "Ampere’s Law",
                "details": [
                  "Ampere’s Law relates the magnetic field around a closed loop to the current passing through the loop. It is expressed as ∮B·dl = μ₀I, where B is the magnetic field, dl is an infinitesimal length of the loop, and I is the current enclosed.",
                  "This law is useful for calculating magnetic fields in systems with high symmetry, such as solenoids or toroids.",
                  "It simplifies the calculation of magnetic fields when the system exhibits symmetry in its current distribution."
                ]
              }
            ]
          }
        ]
      },
      {
        "unitId": "unit_5",
        "unitName": "Unit 5: Electromagnetic Induction",
        "sections": [
          {
            "sectionName": "Faraday's Law",
            "topics": [
              {
                "topicName": "Electromagnetic Induction",
                "details": [
                  "Electromagnetic induction occurs when a change in magnetic flux through a loop induces an electromotive force (EMF) in the loop.",
                  "This is described by Faraday’s Law, which states that the induced EMF is equal to the negative rate of change of magnetic flux: EMF = -dΦB/dt.",
                  "Applications of electromagnetic induction include electric generators, transformers, and induction cooktops."
                ]
              },
              {
                "topicName": "Lenz's Law",
                "details": [
                  "Lenz's Law states that the direction of the induced EMF and current will oppose the change in magnetic flux that caused it, as a consequence of the conservation of energy.",
                  "This law ensures that induced currents work against the change in the magnetic environment that creates them.",
                  "Lenz's Law is used in electromagnetic braking systems and is fundamental in understanding the behavior of inductors."
                ]
              }
            ]
          },
          {
            "sectionName": "Inductors",
            "topics": [
              {
                "topicName": "Inductors and Self-Inductance",
                "details": [
                  "An inductor stores energy in a magnetic field when electric current flows through it. The self-inductance of an inductor, L, is a measure of how much EMF is induced by a change in current.",
                  "The EMF induced in an inductor is given by EMF = -L (dI/dt), where dI/dt is the rate of change of current.",
                  "Inductors are used in circuits to smooth out current changes and are essential in AC circuits, transformers, and filters."
                ]
              }
            ]
          }
        ]
      },
      {
        "unitId": "unit_6",
        "unitName": "Unit 6: Electromagnetic Waves",
        "sections": [
          {
            "sectionName": "Properties of Electromagnetic Waves",
            "topics": [
              {
                "topicName": "Electromagnetic Spectrum",
                "details": [
                  "Electromagnetic waves are transverse waves that consist of oscillating electric and magnetic fields.",
                  "They travel at the speed of light (c = 3.00 x 10⁸ m/s) in a vacuum and do not require a medium to propagate.",
                  "The electromagnetic spectrum includes a range of wavelengths, from radio waves (longest wavelength) to gamma rays (shortest wavelength), with visible light in the middle.",
                  "Different wavelengths correspond to different energies, with shorter wavelengths (higher frequencies) carrying more energy."
                ]
              },
              {
                "topicName": "Wave Equation",
                "details": [
                  "The wave equation for electromagnetic waves in a vacuum is given by c = λf, where λ is the wavelength, f is the frequency, and c is the speed of light.",
                  "Electromagnetic waves obey the principles of wave behavior, including reflection, refraction, diffraction, and interference."
                ]
              }
            ]
          },
          {
            "sectionName": "Energy in Electromagnetic Waves",
            "topics": [
              {
                "topicName": "Poynting Vector",
                "details": [
                  "The Poynting vector represents the rate of energy transfer per unit area in an electromagnetic wave. It is given by S = E x B / μ₀, where E is the electric field, B is the magnetic field, and μ₀ is the permeability of free space.",
                  "The magnitude of the Poynting vector indicates the power per unit area, which is proportional to the product of the electric and magnetic field intensities."
                ]
              },
              {
                "topicName": "Radiation Pressure",
                "details": [
                  "Electromagnetic waves exert pressure when they strike a surface, known as radiation pressure.",
                  "The radiation pressure is given by P = S/c for a perfectly absorbing surface, where S is the magnitude of the Poynting vector and c is the speed of light."
                ]
              }
            ]
          }
        ]
      }
    ]
  }
]